{
  "posts": [
    {
      "id": "1",
      "title": "Getting Started with JSON Server",
      "author": "Jane Smith",
      "date": "2023-10-15T14:30:00Z",
      "category": "Technology",
      "image": "https://images.unsplash.com/photo-1555066931-4365d14bab8c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "excerpt": "Learn how to set up and use JSON Server to create a mock REST API for your frontend projects.",
      "content": "JSON Server is an incredibly useful tool for frontend developers who need to work with a backend API during development. It allows you to create a fully functional REST API with zero coding, using only a JSON file.\n\nSetting up JSON Server is straightforward. First, you need to install it globally or as a development dependency in your project:\n\n```bash\nnpm install -g json-server\n```\n\nOnce installed, create a db.json file with your data structure. For a blog application, this might include posts, comments, and users. Then start the server with:\n\n```bash\njson-server --watch db.json --port 3000\n```\n\nYour API will now be available at http://localhost:3000 with endpoints for all the resources defined in your db.json file. JSON Server supports all CRUD operations (GET, POST, PUT, PATCH, DELETE) and includes features like filtering, pagination, and sorting.\n\nThis makes it perfect for prototyping, testing, and developing frontend applications without needing a real backend."
    },
    {
      "id": "2",
      "title": "Building a Blog with Pure JavaScript",
      "author": "John Doe",
      "date": "2023-10-10T09:15:00Z",
      "category": "Web Development",
      "image": "https://images.unsplash.com/photo-1627398242454-45a1465c2479?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "excerpt": "Discover how to create a fully functional blog application using only HTML, CSS, and vanilla JavaScript.",
      "content": "In today's world of complex frameworks and libraries, it's refreshing to remember that you can build complete applications using just the core web technologies: HTML, CSS, and JavaScript.\n\nThis blog application demonstrates how to create a full-featured content management system without any external dependencies. We handle data persistence using JSON Server, which provides a REST API that our JavaScript code can interact with using the Fetch API.\n\nThe key components of our blog include:\n\n1. **Home Page**: Displays a list of blog posts with pagination\n2. **Article Page**: Shows individual blog posts in detail\n3. **Admin Panel**: Allows creating, editing, and deleting posts\n\nAll data is fetched asynchronously, providing a smooth user experience without page reloads. The application is fully responsive and works on mobile, tablet, and desktop devices.\n\nBy avoiding frameworks, we keep the application lightweight and maintain a clear understanding of what's happening under the hood. This approach is excellent for learning and for projects where simplicity is a priority."
    },
    {
      "id": "3",
      "title": "The Future of Web Development",
      "author": "Alex Johnson",
      "date": "2023-10-05T16:45:00Z",
      "category": "Technology",
      "image": "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "excerpt": "Exploring emerging trends and technologies that are shaping the future of web development.",
      "content": "Web development is an ever-evolving field, with new technologies and approaches constantly emerging. As we look to the future, several trends are becoming increasingly important.\n\n**Progressive Web Apps (PWAs)** continue to gain traction, blurring the line between web and native applications. With features like offline functionality, push notifications, and home screen installation, PWAs offer a native-like experience without the app store overhead.\n\n**Web Assembly (Wasm)** is another transformative technology. By allowing code written in languages like C++, Rust, and Go to run in the browser at near-native speed, Wasm opens up new possibilities for performance-intensive applications like video editing, gaming, and scientific simulations directly in the browser.\n\n**AI Integration** is becoming more accessible, with APIs and libraries that make it easier to add machine learning capabilities to web applications. From intelligent chatbots to image recognition and personalized recommendations, AI is enhancing user experiences across the web.\n\n**Serverless Architecture** continues to grow, allowing developers to build applications without managing infrastructure. Combined with edge computing, this approach delivers faster performance and greater scalability.\n\nWhile frameworks and tools will continue to evolve, the fundamentals of HTML, CSS, and JavaScript remain the bedrock of web development. Understanding these core technologies is more important than ever."
    },
    {
      "title": "Minimalist Design Principles 2",
      "author": "Sarah Williams",
      "category": "Design",
      "image": "https://images.unsplash.com/photo-1516035069371-29a1b244cc32?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1000&q=80",
      "excerpt": "How minimalist design creates better user experiences by focusing on essential elements.",
      "content": "Minimalist design is more than just an aesthetic choice—it's a philosophy that prioritizes clarity, functionality, and user experience. By removing unnecessary elements, minimalist design helps users focus on what's important.\n\n**Key Principles of Minimalist Design:**\n\n1. **Simplicity**: Every element should serve a purpose. If it doesn't add value, remove it.\n\n2. **Whitespace**: Also known as negative space, whitespace gives elements room to breathe and improves readability.\n\n3. **Visual Hierarchy**: Use size, color, and placement to guide users' attention to the most important elements first.\n\n4. **Limited Color Palette**: A restrained color scheme creates cohesion and reduces visual noise.\n\n5. **Typography**: Choose clean, readable fonts and use font weights and sizes to establish hierarchy.\n\n6. **Consistency**: Maintain consistent patterns throughout the design to create a predictable user experience.\n\nIn web design, minimalism often translates to faster loading times, better mobile responsiveness, and improved accessibility. Users can find what they need quickly without being overwhelmed by unnecessary options or visual clutter.\n\nThis blog itself follows minimalist principles with its clean layout, focused content, and straightforward navigation. The design supports the content rather than competing with it.",
      "id": "4"
    },
    {
      "title": "python",
      "author": "john",
      "category": "development",
      "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS23kqlIS7j2Cp8iBcn_2I-vl6bhiNZnwUKIqnrHDUFj8r6cmFv5cDF6VsbAwOc_DQzsALE2on5H97Xvgpd8hBctlWA_Ft5NQK1IsfxuA&s",
      "excerpt": "nothing",
      "content": "This is the popular language in the world",
      "id": "c13a"
    },
    {
      "id": "0699",
      "title": "python",
      "author": "peter",
      "category": "development",
      "image": null,
      "excerpt": "wertyuio",
      "content": "python is the programming language",
      "date": "2025-12-21T07:08:41.309Z"
    }
  ]
}